const rulesUkr =
  'У вас є 12 запитань, кожне з яких ще абсурдніше за попереднє. Вибирайте між рудими принцесами та небезпечними тиграми. Ласка чи лапа? Ваш вибір визначатиме вашу долю, але чесно кажучи, тут важко не програти. Та не хвилюйтеся, милостивий король логіки Реймонд Смалліан, залишив вам підказки. Але не розраховуйте на легкий шлях – життя, як ви знаєте, повне сюрпризів. Готові прийняти виклик і стати легендою або посміховиськом? Починайте гру, і нехай фортуна буде до вас такою ж прихильною, як тигр до обіду!';
export default rulesUkr;
